#8.1
a={"Финляндия":"Хельсинки","Германия":"Берлин","Италия":"Рим","Польша":"Варшава"}
print(a.items())
t=input("mazani:  ")
print(a.get(t))
print(sorted(a))

#8.2
r="слова"
o=0
a={
    ("А", "В", "Е", "И", "Н", "О", "Р", "Т", "С"):1,
    ("Д", "К", "Л", "М", "П", "У"):2,
    ("Б", "Г", "Ё", "Ь", "Я"):3,
    ("Й", "Ы"):4,
    ("Ж", "З", "Х", "Ц", "Ч"):5,
    ("Ш", "Э", "Ю"):8,
    ("Щ", "Ф", "Ъ"):10
}
for t in r.upper():
    for y,u in a.items():
        if t in y:
            o=o+u
print(o)

#8.3
a= {
    "Аня": {"английский", "французский"},
    "Борис": {"английский", "китайский"},
    "Катя": {"немецкий", "испанский"},
    "Дима": {"китайский", "японский"},
}
b=[]
d=[]
for k,v in a.items():
    for l in v:
        b.append(l)
    if "китайский" in v:
        d.append(k)

print("shparyat za chiyny",d,"\n","vsego yazikov",sorted(set(b)))